/*
 * @Author: itap
 * @Date:   2018-09-25 10:03:15
 * @Last Modified by:   itap
 * @Last Modified time: 2019-05-29 23:58:08
 */

export const config = {
  bzLogin: 'http://104.194.1.250:20001/idsecurity/UserLoginResource/v1/auth/login',
  joinPath: 'http://104.194.1.250:20002/mapanalysis/',
  imgPath: 'http://104.194.1.250/sfzh/zpxp/',
  commonPath: "http://104.194.1.250:20005/",
  logPath: "http://104.194.1.250:20004/",
  mainPath: 'http://peacock-idsecurity-biggeryuningress.biggerk8s.landaudev.com/',
  collectPath: 'http://peacock-mapcollect-biggeryuningress.biggerk8s.landaudev.com/mapcollect/',
  webSocket: '104.194.1.250:20001',
  baiduMapPath: 'http://104.168.3.210/maps/aks/',
  fileDownloadPath: 'http://104.194.1.250/file_list/',
  helpFilePath: "http://104.194.1.250/helpfile/",
  imgType: '.jpg',
  project: {
    name: '和田市公安局图谱管理平台',
    version: "",
    locale: 'ht',
    hydraType: 'hydra',
    copyright: '',
    localSuffix: '',
    isShowBg: true
  },
  mapType: {
    HJRK: '户籍人口家谱图谱',
    AJGX: '涉案人员案件关系图谱',
    SHGX: '涉案人员社会关系图谱',
    ZJJD: '宗教极端思想历史传承图谱',
    SWGW: '涉稳高危人员家族图谱',
    SCRY: '朝觐人员关系图谱',
    CRJ: '出入境人员关系图谱'
  },
  properties: {
    profession: "焊工",
    HJD: "地址",
    STATE: "状态",
    RYBQ: "标签",
    politicsStatus: "",
    STATE_COLOR: "",
    XM: "姓名",
    phone: "电话",
    PERSON_ID: "编号",
    FIVE_ONE_PROPERTY: "",
    GENDER: "性别",
    PERSON_DESCRIPTION: "备注",
    SFZHM: "身份证号"
  },
  homeConfig: {
    showSearch: false,
    showTreeDept: false, //首页是否显示单位选择框
  },
  // 图谱页面信息的配置
  mapPageConfig: {
    riskLevelTitle: "风险要素",
    perCountTitle: "家庭总人数:",
    associationAnalysisLocation: true, //关联分析在轨道信息的上面
    showGuiJiLocation: false, //查看档案-图谱node是否显示轨迹信息
  },
  geoCoordMap: {
    '和田市公安局警令部': [79.921135, 37.110943],
    '和田市公安局政工室': [79.921135, 37.110943],
    '和田市公安局警务保障室': [79.921135, 37.110943],
    '和田市公安局警务督察大队': [79.921135, 37.110943],
    '和田市公安局法制大队': [79.921135, 37.110943],
    '和田市公安局纪检监察室': [79.921135, 37.110943],
    '和田市公安局治安管理大队': [79.921135, 37.110943],
    '和田市公安局科技信息化大队': [79.921135, 37.110943],
    '和田市公安局禁毒大队': [79.921135, 37.110943],
    '和田市公安局经济犯罪侦查大队': [79.921135, 37.110943],
    '和田市公安局刑事犯罪侦查大队': [79.921135, 37.110943],
    '和田市公安局出入境管理大队': [79.92071, 37.110433],
    '和田市公安局网络安全管理大队': [79.921135, 37.110943],
    '和田市公安局技术侦察大队': [79.921135, 37.110943],
    '和田市公安局合成作战室': [79.921135, 37.110943],
    '和田市公安局图像侦察大队': [79.921135, 37.110943],
    '和田市公安局交通管理大队': [79.965612, 37.149095],
    '和田市公安局国内安全保卫大队': [79.921135, 37.110943],
    '和田市公安局特巡警大队': [79.921135, 37.110943],
    '和田市公安局看守所': [79.941942, 37.111827],
    '和田市公安局拘留所': [79.921135, 37.110943],
    '和田市公安局古勒巴格街派出所': [79.928454, 37.10829],
    '和田市公安局古江巴格街派出所': [79.936516, 37.099993],
    '和田市公安局努尔巴格街派出所': [79.922868, 37.122104],
    '和田市公安局纳尔巴格街派出所': [79.947085, 37.11943],
    '和田市公安局古江巴格乡派出所': [79.942241, 37.08441],
    '和田市公安局吐沙拉镇派出所': [79.89753, 37.069487],
    '和田市公安局伊力其乡派出所': [79.954035, 37.136155],
    '和田市公安局肖尔巴格乡派出所': [79.890818, 37.126366],
    '和田市公安局拉斯奎镇派出所': [79.879962, 37.173721],
    '和田市公安局吉亚乡派出所': [80.016052, 37.085784],
    '和田市公安局阿克恰勒乡派出所': [80.386197, 37.798576],
    '和田市公安局火车站派出所': [79.913127, 37.163999],
    '和田市公安局北京工业园区派出所': [79.962796, 37.125501],
    '和田市公安局夏玛勒巴格管委会': [79.954336, 37.116496],
    '和田市公安局机场派出所': [79.874446, 37.044211],
    '和田市公安局玉龙喀什镇派出所': [79.992609, 37.095399]
  },
  topTagColors: { //标签颜色
    '户': '#4298c7',
    '族': '#f19d38',
    '危': '#f19d38',
    '案': '#eb4826',
    '宗': '#bf6b27',
    '打': '#ff0000',
    '境': '#993399',
    '暴': '#8d3b65',
    '社': '#bc4166',
    '朝': '#6668c6',
  },
  tagColor: { //五位一体颜色
    '政': '#666666',
    '宗': '#008000',
    '商': '#f49e00',
    '恐': '#333333',
    '黑': '#999999'
  },
  tagIconFont: {
    '政': 'icon-zheng',
    '宗': 'icon-zong1',
    '商': 'icon-shang',
    '恐': 'icon-kong',
    '黑': 'icon-hei'
  },
  personLabel: { //人员状态颜色
    '社会面': '#008800',
    '收押': '#cb4324',
    '收教': '#f7b940',
    '境外': '#ffe900',
    '死亡': '#6B6B6B',
    '去向不明': '#0000fe'
  },
  idNumberVerify: /^(\d{17}[\d|x|X]|\d{15}|WZ\d{16}|Y\d{17}|0000\d{14})$/, // 身份证正则校验
}
