/*
 * @Author: erbing.li
 * @Date:   2019-03-18 16:06:08
 * @Last Modified by:   itap
 * @Last Modified time: 2019-06-13 22:40:21
 */
export const config = {
  //本地接口
  bzLogin: "http://172.16.6.184:20001/idsecurity/UserLoginResource/v1/auth/login",
  joinPath: "http://172.16.6.184:20002/mapanalysis/",
  // joinPath: "http://172.16.11.70:20002/mapanalysis/",
  // joinPath: "http://172.16.3.27:20003/mapanalysis/",
  mainPath: "http://172.16.6.184:20001/",
  commonPath: "http://172.16.6.184:20005/",
  collectPath: "http://172.16.6.184:20003/mapcollect/",
  // collectPath: 'http://172.16.11.70:20003/mapcollect/',
  // collectPath: 'http://172.16.3.27:20003/mapcollect',
  logPath: 'http://172.16.6.184:20004/',
  // 172.16.3.27
  // sockets:'http://172.16.3.27:20001',
  fbtcs: "http://172.16.3.210:20003/mapcollect/",
  webSocket: "172.16.6.184:20001",
  imgPath: "http://172.16.6.184/sfzh/zpxp/",
  helpFilePath: "http://172.16.6.184/helpfile/",
  imgType: ".jpg",
  fileDownloadPath: "http://172.16.6.184/file_list/",
  baiduMapPath: 'http://172.16.6.184/maps/aks/',
  project: {
    name: "蓝灯",
    version: "测试版本",
    locale: "aks", //aks / bz
    hydraType: "hydraCard",
    highlightColor: {
      work_object: "black"
    },
    copyright: "",
    localSuffix: "-aks", // -aks / ''
    isShowBg: false, // false / true
    showOnlyPkiLogin: false //仅使用PKI登录
  },
  mapType: {
    HJRK: "户籍人口家谱图", //code: 1
    HJRK: "宗教极端思想传承图统计",
    AJGX: "涉危安案（事）（件）人员关系图", //code: 4
    SHGX: "历年被打击处理人员分布示意图", //code: 9
    ZJJDBar: "宗教极端思想传承图",
    ZJJD: "宗教极端思想传承体系", //code: 6
    SWGW: "涉案家族关系图", //code: 2
    SCRY: "出入境人员分布图", //code: 8
    CRJ: "境外涉恐涉暴人员关系图" //code: 10
  },
  properties: {
    profession: "焊工",
    HJD: "地址",
    STATE: "状态",
    RYBQ: "属性",
    politicsStatus: "",
    STATE_COLOR: "",
    XM: "姓名",
    phone: "电话",
    PERSON_ID: "编号",
    FIVE_ONE_PROPERTY: "",
    GENDER: "性别",
    PERSON_DESCRIPTION: "备注",
    SFZHM: "身份证号"
  },
  // 首页信息配置
  homeConfig: {
    showSearch: true, //首页是否显示查询和选择单位组合框
    showTreeDept: false //首页是否显示单位选择框
  },
  // 图谱页面信息的配置
  mapPageConfig: {
    riskLevelTitle: "图谱概述", //风险要素
    perCountTitle: "涉及总人数:", //家庭总人数
    associationAnalysisLocation: true, //关联分析在轨道信息的上面
    showGuiJiLocation: false //查看档案-图谱node是否显示轨迹信息
  },
  geoCoordMap: {
    库尔勒市: [86.14974, 41.754747],
    轮台县: [84.261003, 41.782308],
    尉犁县: [86.270207, 41.34715],
    若羌县: [88.16912, 39.023895],
    和静县: [86.39066, 42.331268],
    和硕县: [86.882264, 42.280713],
    博湖县: [86.621455, 41.988616],
    开发区: [86.241749, 41.706085],
    塔里木: [86.164044, 41.759528],
    且末县: [85.537575, 38.15184],
    第二师铁门关市: [85.652321, 41.845494],
    焉耆县: [86.55344, 42.068869],

    和田市公安局警令部: [79.921135, 37.110943],
    和田市公安局政工室: [79.921135, 37.110943],
    和田市公安局警务保障室: [79.921135, 37.110943],
    和田市公安局警务督察大队: [79.921135, 37.110943],
    和田市公安局法制大队: [79.921135, 37.110943],
    和田市公安局纪检监察室: [79.921135, 37.110943],
    和田市公安局治安管理大队: [79.921135, 37.110943],
    和田市公安局科技信息化大队: [79.921135, 37.110943],
    和田市公安局禁毒大队: [79.921135, 37.110943],
    和田市公安局经济犯罪侦查大队: [79.921135, 37.110943],
    和田市公安局刑事犯罪侦查大队: [79.921135, 37.110943],
    和田市公安局出入境管理大队: [79.92071, 37.110433],
    和田市公安局网络安全管理大队: [79.921135, 37.110943],
    和田市公安局技术侦察大队: [79.921135, 37.110943],
    和田市公安局合成作战室: [79.921135, 37.110943],
    和田市公安局图像侦察大队: [79.921135, 37.110943],
    和田市公安局交通管理大队: [79.965612, 37.149095],
    和田市公安局国内安全保卫大队: [79.921135, 37.110943],
    和田市公安局特巡警大队: [79.921135, 37.110943],
    和田市公安局看守所: [79.941942, 37.111827],
    和田市公安局拘留所: [79.921135, 37.110943],
    和田市公安局古勒巴格街派出所: [79.928454, 37.10829],
    和田市公安局古江巴格街派出所: [79.936516, 37.099993],
    和田市公安局努尔巴格街派出所: [79.922868, 37.122104],
    和田市公安局纳尔巴格街派出所: [79.947085, 37.11943],
    和田市公安局古江巴格乡派出所: [79.942241, 37.08441],
    和田市公安局吐沙拉镇派出所: [79.89753, 37.069487],
    和田市公安局伊力其乡派出所: [79.954035, 37.136155],
    和田市公安局肖尔巴格乡派出所: [79.890818, 37.126366],
    和田市公安局拉斯奎镇派出所: [79.879962, 37.173721],
    和田市公安局吉亚乡派出所: [80.016052, 37.085784],
    和田市公安局阿克恰勒乡派出所: [80.386197, 37.798576],
    和田市公安局火车站派出所: [79.913127, 37.163999],
    和田市公安局北京工业园区派出所: [79.962796, 37.125501],
    和田市公安局夏玛勒巴格管委会: [79.954336, 37.116496],
    和田市公安局机场派出所: [79.874446, 37.044211],
    和田市公安局玉龙喀什镇派出所: [79.992609, 37.095399]
  },
  topTagColors: {
    //标签颜色
    户: "#4298c7",
    族: "#f19d38",
    危: "#f19d38",
    案: "#eb4826",
    宗: "#bf6b27",
    打: "#ff0000",
    境: "#993399",
    暴: "#8d3b65",
    社: "#bc4166",
    朝: "#6668c6"
  },
  tagColor: {
    //五位一体颜色
    政: "#666666",
    宗: "#008000",
    商: "#f49e00",
    恐: "#333333",
    黑: "#999999"
  },
  tagColorBz: {
    //五位一体颜色
    政: "#ffffff",
    宗: "#008000",
    商: "#f49e00",
    恐: "#ffffff",
    黑: "#999999"
  },
  tagIconFont: {
    政: "icon-zheng",
    宗: "icon-zong1",
    商: "icon-shang",
    恐: "icon-kong",
    黑: "icon-hei"
  },
  personLabel: {
    //人员状态颜色
    社会面: "#008800",
    收押: "#cb4324",
    收教: "#f7b940",
    境外: "#ffe900",
    死亡: "#6B6B6B",
    去向不明: "#0000fe"
  },
  idNumberVerify: /^(\d{17}[\d|x|X]|\d{15}|WZ\d{16}|Y\d{17}|0000\d{14})$/, // 身份证正则校验
};
