/*
* @Author: itap
* @Date:   2018-12-10 10:59:36
* @Last Modified by:   itap
* @Last Modified time: 2018-12-10 13:29:47
*/
export const usingHelp = {
	questionTitleList : [
    {
      id : 'a',
      title : '系统操作指南'
    },
    {
      id : 'b',
      title : 'iTap合成作战平台4.0更新概要'
    },
    {
      id : 'c',
      title : '关系搜索功能介绍'
    },
    {
      id : 'd',
      title : '关系圈使用指南'
    }
  ],
  helpContList : {
    video : {
      id : 'a',
      title : '1.系统操作指南',
      childTitle : '操作视频',
      content : [
        {
          title : '1.1系统简介',
          cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
        },
        {
          title : '1.2系统操作',
          cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用。'
        }
      ]
    },
    children : [
      {
        id : 'b',
        title : '2.iTap合成作战平台4.0更新概要',
        content : [
          {
            title : '2.1系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          },
          {
            title : '2.2系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          }
        ]
      },
      {
        id : 'c',
        title : '3.关系搜索功能介绍',
        content : [
          {
            title : '3.1系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          },
          {
            title : '3.2系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          }
        ]
      },
      {
        id : 'd',
        title : '4.关系圈使用指南',
        content : [
          {
            title : '4.1系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          },
          {
            title : '4.2系统简介',
            cont : '上海蓝灯数据科技股份有限公司(股票代码:834048)作为云原生时代下，大数据智能微应用平台的倡导者和积极实践者，是国内领先专注于人的行为管理、分析和预测的软件开发商和数据平台运营服务商。以大数据为基础，人工智能为工具，智能设备为载体，微服务治理平台【蓝灯COS】为核心的创新企业级微应用，公司帮助各类企业与组织，实现一系列数字化革新！通过兼收并蓄国际最前沿的软件技术和大数据解决方案，结合国内市场情况，自主创新研发在中国具有前瞻性和实用性的企业级一站式管理解决方案，为中国用户构建具有先进管理理念, 灵活适用, 经济高效的敏捷解决方案，帮助各行业用户从容应对瞬息万变的市场, 实现数字化原生管理。'
          }
        ]
      }
    ]
  }
}